In [19]:
import pandas as pd

In [20]:
city_df = pd.read_excel('D:\\Py files\\Data Cleaning and Preprocessing\\city.xlsx', index_col=0)

In [21]:
city_df

         City  Population
0       Dhaka    30000000
1      Sylhet    10000000
2  Chattagram    20000000
3    Rajshahi    15000000
4     Cumilla      400000

In [22]:
code_df = pd.read_excel('D:\\Py files\\Data Cleaning and Preprocessing\\code.xlsx', index_col=0)

In [23]:
code_df

     Division Code
0       Dhaka  DHK
1      Sylhet   SL
2    Rajshahi  RAJ
3     Barisal  BAR
4  Chattagram  CTG

In [24]:
concat = pd.merge(left=city_df, right=code_df, on=None, left_on = 'City', right_on= 'Division')

In [25]:
concat

         City  Population    Division Code
0       Dhaka    30000000       Dhaka  DHK
1      Sylhet    10000000      Sylhet   SL
2  Chattagram    20000000  Chattagram  CTG
3    Rajshahi    15000000    Rajshahi  RAJ

In [26]:
concat = pd.merge(left=city_df, right=code_df, on=None, left_on = 'City', right_on= 'Division', how= 'outer')

In [27]:
concat

         City  Population    Division Code
0       Dhaka  30000000.0       Dhaka  DHK
1      Sylhet  10000000.0      Sylhet   SL
2  Chattagram  20000000.0  Chattagram  CTG
3    Rajshahi  15000000.0    Rajshahi  RAJ
4     Cumilla    400000.0         NaN  NaN
5         NaN         NaN     Barisal  BAR